# Install packages by executing `brew bundle --global`.

#
# Formula packages
#

# newer than Apple git
brew "git"

# GnuPG
brew "gnupg"

# docker
# (do not install "cask" docker; it is for personal or small business)
# (use Rancher Desktop instead)
#brew "docker"
#brew "docker-compose"
#brew "docker-credential-helper"
#brew "docker-credential-helper-ecr"
brew "docker-completion"

# text editor
brew "neovim"

# terminal multiplexer
brew "tmux"

# node for language server
brew "node"

# Code formatter
brew "biome"

# pager
brew "git-delta"

# json processor
brew "jq"
brew "yq"

# static analysis tool for script
brew "shellcheck"

# websocket
brew "websocat"

# periodic monitoring
brew "watch"

# do parallel job
# (suitable for few number of big jobs)
# (not recommended for benchmark because spawning processes is slow)
#brew "parallel"

# simple CPU/MEM monitor
# htop can replace pstree by using tree view
# pstree can be also replaced by ps on shell script
brew "htop"

# enhanced parallel grep
brew "ripgrep"

# Go parallel gzip (de)compression
brew "pigz"

# FTP client
brew "midnight-commander"

#
# Cask packages
#

# communication tool
cask "slack"

# database client
cask "mongodb-compass"

# desktop agent
cask "postman-agent"

# IDE
cask "visual-studio-code"

# internet browser
cask "google-chrome"
cask "chromium"

# Docker for native environment
cask "rancher"
#cask "podman-desktop"

#
# App Store
#
