#
# Brew packages
#

# newer than Apple git
brew "git"

# docker (do not install "cask" docker; it is for personal or small business)
# Run `brew services start colima` or `colima start -f` after installation
brew "docker"
brew "docker-completion"
brew "docker-compose"
brew "docker-buildx"
brew "docker-credential-helper"
brew "colima"

# newer than Apple vim
brew "vim"

# terminal multiplexer
brew "tmux"

# json processor
brew "jq"

# periodic monitoring
brew "watch"

# do parallel job
# (suitable for few number of big jobs)
# (not recommended for benchmark because spawning processes is slow)
brew "parallel"

# simple CPU/MEM monitor
# htop can replace pstree by using tree view
# pstree can be also replaced by ps on shell script
brew "htop"

# enhanced parallel grep
brew "ripgrep"

# Go parallel gzip (de)compression
brew "pigz"

# FTP client
brew "midnight-commander"

#
# Cask packages
#

# communication tool
cask "slack"

# database client
cask "mongodb-compass"

# desktop agent
cask "postman-agent"

# IDE
cask "visual-studio-code"

# internet browser
cask "google-chrome"
cask "chromium"

#
# App Store
#
